ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR32DA28def.inc
; CLKCTRL_MCLKCTRLA masks
.equ CLKCTRL_CLKSEL_gm = 0x07            ; Clock select group mask
.equ CLKCTRL_CLKSEL_gp = 0               ; Clock select group position
.equ CLKCTRL_CLKSEL_0_bm = (1<<0)        ; Clock select bit 0 mask
.equ CLKCTRL_CLKSEL_0_bp = 0             ; Clock select bit 0 position
.equ CLKCTRL_CLKSEL_1_bm = (1<<1)        ; Clock select bit 1 mask
.equ CLKCTRL_CLKSEL_1_bp = 1             ; Clock select bit 1 position
.equ CLKCTRL_CLKSEL_2_bm = (1<<2)        ; Clock select bit 2 mask
.equ CLKCTRL_CLKSEL_2_bp = 2             ; Clock select bit 2 position
.equ CLKCTRL_CLKOUT_bm = 0x80            ; System clock out bit mask
.equ CLKCTRL_CLKOUT_bp = 7               ; System clock out bit position

; CLKCTRL_MCLKCTRLB masks
.equ CLKCTRL_PEN_bm = 0x01               ; Prescaler enable bit mask
.equ CLKCTRL_PEN_bp = 0                  ; Prescaler enable bit position
.equ CLKCTRL_PDIV_gm = 0x1E              ; Prescaler division group mask
.equ CLKCTRL_PDIV_gp = 1                 ; Prescaler division group position
.equ CLKCTRL_PDIV_0_bm = (1<<1)          ; Prescaler division bit 0 mask
.equ CLKCTRL_PDIV_0_bp = 1               ; Prescaler division bit 0 position
.equ CLKCTRL_PDIV_1_bm = (1<<2)          ; Prescaler division bit 1 mask
.equ CLKCTRL_PDIV_1_bp = 2               ; Prescaler division bit 1 position
.equ CLKCTRL_PDIV_2_bm = (1<<3)          ; Prescaler division bit 2 mask
.equ CLKCTRL_PDIV_2_bp = 3               ; Prescaler division bit 2 position
.equ CLKCTRL_PDIV_3_bm = (1<<4)          ; Prescaler division bit 3 mask
.equ CLKCTRL_PDIV_3_bp = 4               ; Prescaler division bit 3 position

; CLKCTRL_MCLKLOCK masks
.equ CLKCTRL_LOCKEN_bm = 0x01            ; lock ebable bit mask
.equ CLKCTRL_LOCKEN_bp = 0               ; lock ebable bit position

; CLKCTRL_MCLKSTATUS masks
.equ CLKCTRL_SOSC_bm = 0x01              ; System Oscillator changing bit mask
.equ CLKCTRL_SOSC_bp = 0                 ; System Oscillator changing bit position
.equ CLKCTRL_OSCHFS_bm = 0x02            ; High frequency oscillator status bit mask
.equ CLKCTRL_OSCHFS_bp = 1               ; High frequency oscillator status bit position
.equ CLKCTRL_OSC32KS_bm = 0x04           ; 32KHz oscillator status bit mask
.equ CLKCTRL_OSC32KS_bp = 2              ; 32KHz oscillator status bit position
.equ CLKCTRL_XOSC32KS_bm = 0x08          ; 32.768 kHz Crystal Oscillator status bit mask
.equ CLKCTRL_XOSC32KS_bp = 3             ; 32.768 kHz Crystal Oscillator status bit position
.equ CLKCTRL_EXTS_bm = 0x10              ; External Clock status bit mask
.equ CLKCTRL_EXTS_bp = 4                 ; External Clock status bit position
.equ CLKCTRL_PLLS_bm = 0x20              ; PLL oscillator status bit mask
.equ CLKCTRL_PLLS_bp = 5                 ; PLL oscillator status bit position

; CLKCTRL_OSCHFCTRLA masks
.equ CLKCTRL_AUTOTUNE_bm = 0x01          ; Autotune bit mask
.equ CLKCTRL_AUTOTUNE_bp = 0             ; Autotune bit position
.equ CLKCTRL_FRQSEL_gm = 0x3C            ; Frequency select group mask
.equ CLKCTRL_FRQSEL_gp = 2               ; Frequency select group position
.equ CLKCTRL_FRQSEL_0_bm = (1<<2)        ; Frequency select bit 0 mask
.equ CLKCTRL_FRQSEL_0_bp = 2             ; Frequency select bit 0 position
.equ CLKCTRL_FRQSEL_1_bm = (1<<3)        ; Frequency select bit 1 mask
.equ CLKCTRL_FRQSEL_1_bp = 3             ; Frequency select bit 1 position
.equ CLKCTRL_FRQSEL_2_bm = (1<<4)        ; Frequency select bit 2 mask
.equ CLKCTRL_FRQSEL_2_bp = 4             ; Frequency select bit 2 position
.equ CLKCTRL_FRQSEL_3_bm = (1<<5)        ; Frequency select bit 3 mask
.equ CLKCTRL_FRQSEL_3_bp = 5             ; Frequency select bit 3 position
.equ CLKCTRL_RUNSTDBY_bm = 0x80          ; Run standby bit mask
.equ CLKCTRL_RUNSTDBY_bp = 7             ; Run standby bit position

; CLKCTRL_OSCHFTUNE masks
.equ CLKCTRL_TUNE_gm = 0xFF              ; Tune group mask
.equ CLKCTRL_TUNE_gp = 0                 ; Tune group position
.equ CLKCTRL_TUNE_0_bm = (1<<0)          ; Tune bit 0 mask
.equ CLKCTRL_TUNE_0_bp = 0               ; Tune bit 0 position
.equ CLKCTRL_TUNE_1_bm = (1<<1)          ; Tune bit 1 mask
.equ CLKCTRL_TUNE_1_bp = 1               ; Tune bit 1 position
.equ CLKCTRL_TUNE_2_bm = (1<<2)          ; Tune bit 2 mask
.equ CLKCTRL_TUNE_2_bp = 2               ; Tune bit 2 position
.equ CLKCTRL_TUNE_3_bm = (1<<3)          ; Tune bit 3 mask
.equ CLKCTRL_TUNE_3_bp = 3               ; Tune bit 3 position
.equ CLKCTRL_TUNE_4_bm = (1<<4)          ; Tune bit 4 mask
.equ CLKCTRL_TUNE_4_bp = 4               ; Tune bit 4 position
.equ CLKCTRL_TUNE_5_bm = (1<<5)          ; Tune bit 5 mask
.equ CLKCTRL_TUNE_5_bp = 5               ; Tune bit 5 position
.equ CLKCTRL_TUNE_6_bm = (1<<6)          ; Tune bit 6 mask
.equ CLKCTRL_TUNE_6_bp = 6               ; Tune bit 6 position
.equ CLKCTRL_TUNE_7_bm = (1<<7)          ; Tune bit 7 mask
.equ CLKCTRL_TUNE_7_bp = 7               ; Tune bit 7 position

; CLKCTRL_PLLCTRLA masks
.equ CLKCTRL_MULFAC_gm = 0x03            ; Multiplication factor group mask
.equ CLKCTRL_MULFAC_gp = 0               ; Multiplication factor group position
.equ CLKCTRL_MULFAC_0_bm = (1<<0)        ; Multiplication factor bit 0 mask
.equ CLKCTRL_MULFAC_0_bp = 0             ; Multiplication factor bit 0 position
.equ CLKCTRL_MULFAC_1_bm = (1<<1)        ; Multiplication factor bit 1 mask
.equ CLKCTRL_MULFAC_1_bp = 1             ; Multiplication factor bit 1 position
.equ CLKCTRL_SOURCE_bm = 0x40            ; Source bit mask
.equ CLKCTRL_SOURCE_bp = 6               ; Source bit position
; Masks for CLKCTRL_RUNSTDBY already defined

; CLKCTRL_OSC32KCTRLA masks
; Masks for CLKCTRL_RUNSTDBY already defined

; CLKCTRL_XOSC32KCTRLA masks
.equ CLKCTRL_ENABLE_bm = 0x01            ; Enable bit mask
.equ CLKCTRL_ENABLE_bp = 0               ; Enable bit position
.equ CLKCTRL_LPMODE_bm = 0x02            ; Low power mode bit mask
.equ CLKCTRL_LPMODE_bp = 1               ; Low power mode bit position
.equ CLKCTRL_SEL_bm = 0x04               ; Select bit mask
.equ CLKCTRL_SEL_bp = 2                  ; Select bit position
.equ CLKCTRL_CSUT_gm = 0x30              ; Crystal startup time group mask
.equ CLKCTRL_CSUT_gp = 4                 ; Crystal startup time group position
.equ CLKCTRL_CSUT_0_bm = (1<<4)          ; Crystal startup time bit 0 mask
.equ CLKCTRL_CSUT_0_bp = 4               ; Crystal startup time bit 0 position
.equ CLKCTRL_CSUT_1_bm = (1<<5)          ; Crystal startup time bit 1 mask
.equ CLKCTRL_CSUT_1_bp = 5               ; Crystal startup time bit 1 position
; Masks for CLKCTRL_RUNSTDBY already defined

; Clock select
.equ CLKCTRL_CLKSEL_OSCHF_gc = (0x00<<0) ; Internal high-frequency oscillator
.equ CLKCTRL_CLKSEL_OSC32K_gc = (0x01<<0) ; Internal 32.768 kHz oscillator
.equ CLKCTRL_CLKSEL_XOSC32K_gc = (0x02<<0) ; 32.768 kHz crystal oscillator
.equ CLKCTRL_CLKSEL_EXTCLK_gc = (0x03<<0) ; External clock

; Prescaler division select
.equ CLKCTRL_PDIV_2X_gc = (0x00<<1)      ; 2X
.equ CLKCTRL_PDIV_4X_gc = (0x01<<1)      ; 4X
.equ CLKCTRL_PDIV_8X_gc = (0x02<<1)      ; 8X
.equ CLKCTRL_PDIV_16X_gc = (0x03<<1)     ; 16X
.equ CLKCTRL_PDIV_32X_gc = (0x04<<1)     ; 32X
.equ CLKCTRL_PDIV_64X_gc = (0x05<<1)     ; 64X
.equ CLKCTRL_PDIV_6X_gc = (0x08<<1)      ; 6X
.equ CLKCTRL_PDIV_10X_gc = (0x09<<1)     ; 10X
.equ CLKCTRL_PDIV_12X_gc = (0x0A<<1)     ; 12X
.equ CLKCTRL_PDIV_24X_gc = (0x0B<<1)     ; 24X
.equ CLKCTRL_PDIV_48X_gc = (0x0C<<1)     ; 48X

; Frequency select
.equ CLKCTRL_FRQSEL_1M_gc = (0x00<<2)    ; 1 MHz system clock
.equ CLKCTRL_FRQSEL_2M_gc = (0x01<<2)    ; 2 MHz system clock
.equ CLKCTRL_FRQSEL_3M_gc = (0x02<<2)    ; 3 MHz system clock
.equ CLKCTRL_FRQSEL_4M_gc = (0x03<<2)    ; 4 MHz system clock (default)
.equ CLKCTRL_FRQSEL_8M_gc = (0x05<<2)    ; 8 MHz system clock
.equ CLKCTRL_FRQSEL_12M_gc = (0x06<<2)   ; 12 MHz system clock
.equ CLKCTRL_FRQSEL_16M_gc = (0x07<<2)   ; 16 MHz system clock
.equ CLKCTRL_FRQSEL_20M_gc = (0x08<<2)   ; 20 MHz system clock
.equ CLKCTRL_FRQSEL_24M_gc = (0x09<<2)   ; 24 MHz system clock

